
# Символи, що відповідають кнопкам на телефонах
# Кнопка 	Символи
#     1 	. , ? ! :
#     2 	A B C
#     3 	D E F
#     4 	G H I
#     5 	J K L
#     6 	M N O
#     7 	P Q R S
#     8 	T U V
#     9 	W X Y Z
#     0 	Пробіл

# Напишіть функцію sequence_buttons, що показує послідовність кнопок, яку необхідно натиснути, щоб на екрані телефону з'явився текст, введений користувачем.

# Створіть словник, який відповідає символам з кнопками, які потрібно натиснути.

# Приклад: якщо функції sequence_buttons передати рядок "Hello, World!", функція повинна повернути "4433555555666110966677755531111".

# Вимоги:
#    функція коректно обробляє малі та великі літери.
#    функція ігнорує символи, що не входять до зазначеного списку

def sequence_buttons(string):
    phone_dict ={
        1:	".,?!:",
        2:	"ABC",
        3:	"DEF",
        4:	"GHI",
        5:	"JKL",
        6:	"MNO",
        7:	"PQRS",
        8:	"TUV",
        9:	"WXYZ",
        0:	" "
        }
    string = string.upper()
    final_word = ""
    for i in string:
        for key, value in phone_dict.items():
            if i in value:
                final_word += str(key)*(value.index(i)+1)
    return final_word
